{

    "LANGUAGES": {
        "FR": "Fançais",
        "EN": "Anglais"
    },
    "ERRORS": {
        "REQUIRED": "Le champ '{{input}}' est requis.",
        "TYPE": "Le champ '{{input}}' doit être de type '{{type}}'"
    },
    "ABOUT": {
        "RESUME_FILE": "CV Adrien Syrotnik.pdf",
        "TITLE": "Entrepreneur et Automatisations IA",
        "DESC": "Bonjour, je suis Adrien Syrotnik, 24 ans, entrepreneur depuis janvier 2025. J'ai créé Sinortica, spécialisée dans les automatisations IA pour améliorer la productivité des entreprises.<br><br>Diplômé ingénieur informatique du CESI Reims, j'ai développé une expertise en réalité virtuelle/augmentée (Unity, Unreal Engine), développement Web (Angular, Solidity) et IA. Mon expérience chez Bertrandt à Paris m'a permis de travailler sur des projets innovants en VR/AR pour l'aéronautique et l'automobile.<br><br>Aujourd'hui, je mets cette expertise au service des entreprises pour concevoir des solutions techniques sur mesure.<br/><br/>Contactez-moi via la partie <a href='#contact'>contact</a>. Consultez mon CV <a href='assets/dl/CV Adrien Syrotnik.pdf' download='CV Adrien Syrotnik.pdf'>ici</a> et mon portfolio <a href='/portfolio' target='_blank'>ici</a>.",
        "SHORT_DESC": "Entrepreneur de 24 ans, fondateur de Sinortica spécialisée dans les automatisations IA. Diplômé ingénieur informatique du CESI, expert en VR/AR, développement Web et IA. Expérience chez Bertrandt Paris en conception de solutions techniques innovantes."
    },
        "EXPERIENCES": {
        "ADEE": {
            "NAME": "Stage développeur Web FullStack",
            "DESC": "Stage durant lequel je devais continuer le développement une application web de gestion de projet, fait en PHP, HTML, CSS et JS. De plus, je devais m'occuper de la migration de leur base de données en passant de mySQL à SQLServer."
        },
        "FLEXNETWORK": {
            "NAME": "Stage développeur Web front-end Angular",
            "DESC": "Stage durant lequel je devais développer le front-end de la 2ème version de leur application web à l'aide du framework Angular. J'ai donc communiqué avec leur backend à l'aide d'une API et réalisé un développement continue à l'aide de l'outil CI-CD sur GitLab."
        },
        "CESI": {
            "NAME": "Ecole d'ingénieurs informatique",
            "DESC": "Souhaitant réaliser un Master en informatique, j'ai décidé d'entrer au CESI, une école d'ingénieurs informatique. Projets et méthode \"PBL\", grâce à tout cela, CESI me permet d'augmenter en autonomie, en compétence et en travail en groupe efficacement."
        },
        "UNIVERSITE-TECHNIQUE-CLUJ-NAPOCA": {
            "NAME": "Stage développeur VR - AR",
            "DESC": "Stage à l'étranger (Erasmus+) en Roumanie, au cours duquel j'ai dû réaliser différentes applications utilisant la VR et l'AR (réalité virtuelle et augmentée)."
        },
        "BERTRANDT-SAS-ALTERNANCE" : {
            "NAME": "Alternance développeur VR - AR",
            "DESC": "Alternance au sein de la société Bertrandt SAS à Paris, au cours de laquelle j'ai réalisé différentes applications utilisant la VR et l'AR (réalité virtuelle et augmentée). J'ai pu travailler dans les secteurs de l'aéronautique et de l'automobile."
        },
        "BERTRANDT-SAS-CDI" : {
            "NAME": "Ingénieur Réalité Augmentée",
            "DESC": "Poste en CDI au sein de la société Bertrandt SAS à Paris. J'ai conçu et géré des projets d'applications en réalité augmentée et virtuelle dans différents secteurs d'activité. J'ai également participé à la conception d'une solution de matching CV/Offres d'emploi basée sur l'intelligence artificielle (LLM et RAG)."
        },
        "SINORTICA": {
            "NAME": "Micro-entreprise de développement logiciel",
            "DESC": "Création de ma micro-entreprise spécialisée dans le développement de solutions logicielles IA. Analyse des processus métier des clients pour automatiser certaines tâches à l'aide de l'intelligence artificielle et ainsi améliorer leur productivité."
        }
    },
    "HOBBIES-DESC": {
        "VIDEOGAMES": "Grand fan de jeu vidéo, j'aime autant jouer en solo qu'en équipe comme sur LOL ou CS GO.",
        "CRYPTO": "Je m'intéresse aux cryptomonnaies, autant au niveau financier, qu'à son niveau technologique.",
        "3D-PRINTING": "J'aime bien modéliser et imprimer des objets en 3D, que ce soit pour le fun ou pour des projets personnels.",
        "PROGRAM": "J'adore développer ! Comme des petits programmes ou alors customiser des jeux comme <u>Minecraft</u>.",
        "PIANO": "J'aime jouer du piano de temps en temps."
    },
    "TITLES": {
        "EXPERIENCE": "<i>Mes Formations et Expériences</i>",
        "PROJECTS": "<i>Mes différents projets</i>",
        "HOBBIES": "<i>Mes passions</i>",
        "SKILLS": "<i>Mes compétences</i>",
        "CONTACT": "<i>Me contacter</i>",
        "SENDMAIL": "Envoyez moi un mail !",
        "FUNSKILLS": "Mes compétences en cours",
        "ABOUT": "<i>A propos de moi</i>",
        "LANGUAGES": "<i>Langues</i>",
        "CERTIF": "<i>Certificats</i>"
    },
    "SENDMAIL": {
        "EMAIL": "Votre e-mail :",
        "MESSAGE": "Votre message :",
        "SEND": "Envoyer",
        "SUCCESS": "Message envoyé avec succès !",
        "ERROR": "Une erreur est survenue..."
    },
    "FOOTER": {
        "HOME": "Accueil"
    },

    "RESUME": "CV",

    "MORE_INFOS": "Plus d'informations <a href='{{link}}'>ici</a>.",

    "Unity Game (Not finish)": "Jeu Unity (Non terminé)",
    "Minesweeper": "Démineur",
    "Online resume v1": "CV en ligne v1",
    "Online resume v2": "CV en ligne v2",

    "Issued by": "Délivré par"

}