{

    "LANGUAGES": {
        "FR": "Fançais",
        "EN": "Anglais"
    },
    "ERRORS": {
        "REQUIRED": "Le champ '{{input}}' est requis.",
        "TYPE": "Le champ '{{input}}' doit être de type '{{type}}'"
    },
    "ABOUT": {
        "RESUME_FILE": "CV Adrien Syrotnik.pdf",
        "TITLE": "À la recherche d'une alternance en ingénierie informatique",
        "DESC": "Bonjour, je suis Adrien Syrotnik, j'ai 21 ans et je suis en 4ème année d'études en ingénierie informatique au CESI à Reims. Mon objectif professionnel est de devenir ingénieur spécialisé dans le domaine de la 3D et de la réalité virtuelle.<br><br> Au cours de ma formation, j'ai acquis des compétences en travaillant sur des projets utilisant les moteurs Unity et Unreal Engine. J'ai également des connaissances en développement logiciel (C++, C#), Web 2.0 (HTML, CSS, Angular), Web 3.0 (Solidity, Web3.js), réseau et intelligence artificielle.<br><br>Je possède des compétences essentielles pour être un ingénieur, telles que la résolution de problèmes, l'analyse et la pensée critique. Je suis capable de comprendre les besoins des clients, de concevoir des solutions techniques et de travailler de manière efficace en équipe ou de manière autonome.<br/><br/>Actuellement, je recherche une alternance de fin d'études pour me préparer au monde du travail. Si vous êtes intéressé par mon profil, n'hésitez pas à me contacter via la partie <a href='#contact'>contact</a>. Vous pouvez également consulter mon CV en format PDF via ce <a href='assets/dl/CV Adrien SYROTNIK.pdf' target='_blank'>lien</a> et mon portfolio accessible via ce <a href='/portfolio' target='_blank'>lien</a>.",
        "SHORT_DESC": "Je suis Adrien Syrotnik, un étudiant de 21 ans en 4ème année d'études en ingénierie informatique au CESI à Reims. Mon objectif professionnel est de devenir ingénieur spécialisé dans le domaine de la 3D et de la réalité virtuelle.<br>J'ai acquis des compétences en travaillant sur des projets utilisant les moteurs Unity et Unreal Engine ainsi que dans les domaines du Web 2.0, du Web 3.0, du réseau et de l'intelligence artificielle. Je possède des compétences telles que la résolution de problèmes, l'analyse et la pensée critique.<br>Actuellement, je recherche une alternance de fin d'études."
    },
    "EXPERIENCES": {
        "ADEE": {
            "NAME": "Stage développeur Web FullStack",
            "DESC": "Stage durant lequel je devais continuer le développement une application web de gestion de projet, fait en PHP, HTML, CSS et JS. De plus, je devais m'occuper de la migration de leur base de données en passant de mySQL à SQLServer."
        },
        "FLEXNETWORK": {
            "NAME": "Stage développeur Web front-end Angular",
            "DESC": "Stage durant lequel je devais développer le front-end de la 2ème version de leur application web à l'aide du framework Angular. J'ai donc communiqué avec leur backend à l'aide d'une API et réalisé un développement continue à l'aide de l'outil CI-CD sur GitLab."
        },
        "CESI": {
            "NAME": "Ecole d'ingénieurs informatique",
            "DESC": "Souhaitant réaliser un Master en informatique, j'ai décidé d'entrer au CESI, une école d'ingénieurs informatique. Projets et méthode \"PBL\", grâce à tout cela, CESI me permet d'augmenter en autonomie, en compétence et en travail en groupe efficacement."
        },
        "UNIVERSITE-TECHNIQUE-CLUJ-NAPOCA": {
            "NAME": "Stage développeur VR - AR",
            "DESC": "Stage à l'étranger (Erasmus+) en Roumanie, au cours duquel j'ai dû réaliser différentes applications utilisant la VR et l'AR (réalité virtuelle et augmentée)."
        }
    },
    "HOBBIES-DESC": {
        "VIDEOGAMES": "Grand fan de jeu vidéo, j'aime autant jouer en solo qu'en équipe comme sur LOL ou CS GO.",
        "CRYPTO": "Je m'intéresse aux cryptomonnaies, autant au niveau financier, qu'à son niveau technologique.",
        "PROGRAM": "J'adore développer ! Comme des petits programmes ou alors customiser des jeux comme <u>Minecraft</u>.",
        "PIANO": "J'aime jouer du piano de temps en temps."
    },
    "TITLES": {
        "EXPERIENCE": "<i>Mes Formations et Expériences</i>",
        "PROJECTS": "<i>Mes différents projets</i>",
        "HOBBIES": "<i>Mes passions</i>",
        "SKILLS": "<i>Mes compétences</i>",
        "CONTACT": "<i>Me contacter</i>",
        "SENDMAIL": "Envoyez moi un mail !",
        "FUNSKILLS": "Mes compétences en cours",
        "ABOUT": "<i>A propos de moi</i>",
        "LANGUAGES": "<i>Langues</i>",
        "CERTIF": "<i>Certificats</i>"
    },
    "SENDMAIL": {
        "EMAIL": "Votre e-mail :",
        "MESSAGE": "Votre message :",
        "SEND": "Envoyer",
        "SUCCESS": "Message envoyé avec succès !",
        "ERROR": "Une erreur est survenue..."
    },
    "FOOTER": {
        "HOME": "Accueil"
    },

    "RESUME": "CV",

    "MORE_INFOS": "Plus d'informations <a href='{{link}}'>ici</a>.",

    "Unity Game (Not finish)": "Jeu Unity (Non terminé)",
    "Minesweeper": "Démineur",
    "Online resume v1": "CV en ligne v1",
    "Online resume v2": "CV en ligne v2",

    "Issued by": "Délivré par"

}